/***************************************************************************************************
* Copyright (C), 2015-2016 Suzhou Kunhou Automation Co.,Ltd
* File name:   KHErrors.h
* Description:
* Version:      0.0.1
* History: 
* (1) Author:   taibaidl
*     Date:     2016-05-10
*     Operate:  Create
*     Version:  0.0.1
* Others: 
***************************************************************************************************/
#ifndef _KH_ERRORS_H_
#define _KH_ERRORS_H_

/***************************************************************************************************
MARCO DEFINITION
***************************************************************************************************/
#define KH_NOERROR         0x00000000          // √ª”–¥ÌŒÛ
#define KH_NULL_PTR        0x00000001          // ø’÷∏’Î¥ÌŒÛ
 

#endif//_KH_ERRORS_H_